Examinator/src/InformationRegisters/ПубликацииЭлектронныхРесурсовСУЗ/ПубликацииЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубликацииЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЭлектронногоРесурса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеКнопкиВыхода</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияКнопкиВыходаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещеныДанныеДляВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПовторноеПрохождениеЭлектронныхРесурсовСУЗ/ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДополнительныеПопыткиПрохожденияТестовСУЗ/ДополнительныеПопыткиПрохожденияТестовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПопыткиПрохожденияТестовСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ДобавившийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ИсторияРазработкиЭлектронныхРесурсовСУО/ИсторияРазработкиЭлектронныхРесурсовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРазработкиЭлектронныхРесурсовСУО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияНадЭлектроннымиРесурсамиСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыСессийЭлектронныхРесурсовСУЗ/ТипыСессийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСессийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>course</name>
  </enumValues>
  <enumValues>
    <name>staticPage</name>
  </enumValues>
  <enumValues>
    <name>SCOPage</name>
  </enumValues>
  <enumValues>
    <name>quiz</name>
  </enumValues>
  <enumValues>
    <name>answerQuestion</name>
  </enumValues>
  <enumValues>
    <name>cabinetLearning</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/МетодВыбораПопыткиПрохожденияСУЗ/МетодВыбораПопыткиПрохожденияСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодВыбораПопыткиПрохожденияСУЗ</name>
  <enumValues>
    <name>Последнюю</name>
  </enumValues>
  <enumValues>
    <name>СНаибольшимРезультатом</name>
  </enumValues>
  <enumValues>
    <name>СНаименьшимРезультатом</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПлеерыКурсовВебКабинетаСУЗ/ПлеерыКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлеерыКурсовВебКабинетаСУЗ</name>
  <enumValues>
    <name>Автономный</name>
  </enumValues>
  <enumValues>
    <name>Встроенный</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ДействияНадЭлектроннымиРесурсамиСУО/ДействияНадЭлектроннымиРесурсамиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияНадЭлектроннымиРесурсамиСУО</name>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/CommonModules/ЭлектронныеРесурсыСУЗ/Module.bsl
/////////////////////////////////////////////////////////////////
// РАБОТА С ЭЛЕКТРОННЫМИ РЕСУРСАМИ НА СЕРВЕРЕ

Функция ВерсияПодсистемы() Экспорт
	
	Возврат "3.0.9.151";
	
КонецФункции

Функция ПолучитьСвойства(ЭлектронныйРесурс, ПрохождениеОбучения = Неопределено, Задание = Неопределено, Пользователь = Неопределено, КонтрольнаяСумма = 0, КорневаяСессияПрохождения = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения)
		И НЕ ЗначениеЗаполнено(Задание) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;
	
	// Определяем переменные
	//
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;	

	ДанныеПрохождения = Неопределено;
	Если КорневаяСессияПрохождения = Неопределено Тогда
		КорневаяСессияПрохождения = Документы.СессияЭлектронногоРесурсаСУЗ.КорневаяСессияПрохожденияЭлектронногоКурса(Пользователь, ПрохождениеОбучения, ЭлектронныйРесурс, Задание, Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.course);
	КонецЕсли;
	
	// Находим все сессии прохождения объектов электронного ресурса
	//
	
	Если ЗначениеЗаполнено(КорневаяСессияПрохождения) Тогда
		
		// Ранее проходили электронный ресурс		

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СессияЭлектронногоРесурсаСУЗ.ДанныеТекстовые
			|ИЗ
			|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
			|ГДЕ
			|	СессияЭлектронногоРесурсаСУЗ.Пользователь = &Пользователь
			|	И СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
			|	И СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
			|	И СессияЭлектронногоРесурсаСУЗ.Задание = &Задание
			|	И СессияЭлектронногоРесурсаСУЗ.Проведен = ИСТИНА
			|	И СессияЭлектронногоРесурсаСУЗ.Отменено = ЛОЖЬ";

		Запрос.УстановитьПараметр("Задание", Задание);
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			ДанныеПрохождения = "[";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДанныеПрохождения = ДанныеПрохождения + ВыборкаДетальныеЗаписи.ДанныеТекстовые.Получить() + ",";	
			КонецЦикла;
			
			ДанныеПрохождения = Сред(ДанныеПрохождения, 1, СтрДлина(ДанныеПрохождения)-1);
			
			ДанныеПрохождения = ДанныеПрохождения + "]";
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Данные = ПолучитьСвойстваПубликации(ЭлектронныйРесурс, КонтрольнаяСумма);
	
	Если Данные <> Неопределено Тогда
		Данные.Вставить("ДанныеПрохождения", ДанныеПрохождения);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСвойстваПубликации(ЭлектронныйРесурс, КонтрольнаяСумма = 0) Экспорт
	
	Запрос = Новый Запрос;
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПубликацииЭлектронныхРесурсовСУЗ.КонтрольнаяСумма КАК КонтрольнаяСумма,
		|	ПубликацииЭлектронныхРесурсовСУЗ.ДатаЭлектронногоРесурса КАК ДатаЭлектронногоРесурса,
		|	ПубликацииЭлектронныхРесурсовСУЗ.Версия КАК Версия,
		|	ПубликацииЭлектронныхРесурсовСУЗ.Наименование КАК Наименование,
		|	ПубликацииЭлектронныхРесурсовСУЗ.Размер КАК Размер,
		|	ПубликацииЭлектронныхРесурсовСУЗ.Описание КАК Описание,
		|	ПубликацииЭлектронныхРесурсовСУЗ.РазмещеныДанныеДляВебКабинета КАК РазмещеныДанныеДляВебКабинета,
		|	ПубликацииЭлектронныхРесурсовСУЗ.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПубликацииЭлектронныхРесурсовСУЗ КАК ПубликацииЭлектронныхРесурсовСУЗ
		|ГДЕ
		|	&ОтборПоКонтрольнойСумме
		|	И ПубликацииЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПубликацииЭлектронныхРесурсовСУЗ.Период УБЫВ";

				
	Если ЗначениеЗаполнено(КонтрольнаяСумма) Тогда		
		Подстановка2 = "КонтрольнаяСумма = &КонтрольнаяСумма";		
		Запрос.УстановитьПараметр("КонтрольнаяСумма", КонтрольнаяСумма);		
	Иначе		
		Подстановка2 = "ИСТИНА";		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(ШаблонЗапроса, "&ОтборПоКонтрольнойСумме", Подстановка2);
	
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();

		СвойстваПубликации = Новый Структура("Период, КонтрольнаяСумма, ДатаЭлектронногоРесурса, Версия, Наименование, Размер, Описание, РазмещеныДанныеДляВебКабинета");
		
		СвойстваПубликации.Период                        = ВыборкаДетальныеЗаписи.Период;
		СвойстваПубликации.КонтрольнаяСумма              = ВыборкаДетальныеЗаписи.КонтрольнаяСумма;
		СвойстваПубликации.ДатаЭлектронногоРесурса       = ВыборкаДетальныеЗаписи.ДатаЭлектронногоРесурса;
		СвойстваПубликации.Версия                        = ВыборкаДетальныеЗаписи.Версия;
		СвойстваПубликации.Наименование                  = ВыборкаДетальныеЗаписи.Наименование;
		СвойстваПубликации.Размер                        = ВыборкаДетальныеЗаписи.Размер;
		СвойстваПубликации.Описание                      = ВыборкаДетальныеЗаписи.Описание;
		СвойстваПубликации.РазмещеныДанныеДляВебКабинета = ВыборкаДетальныеЗаписи.РазмещеныДанныеДляВебКабинета;
		
		Возврат СвойстваПубликации;
		
	КонецЕсли;		
	
КонецФункции

Функция СохранитьДанныеПрохождения(Знач Данные, ЭлектронныйРесурс, КонтрольнаяСумма, Пользователь, ПрохождениеОбучения, Задание, ЭтоПроверкаПреподавателем) Экспорт
	
	// Получаем данные сессий из строковых данных
	//
	
	МассивСессий = ОбщегоНазначенияСУ.JSONВДанные(Данные, СтрДлина(Данные));
	
	Если НЕ ТипЗнч(МассивСессий) = Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'Неверный тип данных'");			
	КонецЕсли;
	
	// Формируем объекты сессий
	//
	
	НачатьТранзакцию();
	
	Попытка
		
		СледуетОбновитьДанныеОбучения = Ложь;
		ЭтаВерсияПередаетСессиюКурсаПриВыходе = Ложь;
		
		Для каждого Сессия Из МассивСессий Цикл
			
			Если НЕ ТипЗнч(Сессия) = Тип("Структура") Тогда
				ВызватьИсключение НСтр("ru = 'Неверный тип данных сессии'");			
			КонецЕсли;
			
			Если Сессия.Свойство("version") Тогда
				// Новая версия плеера при выходе из курса
				// передает сессию курса в общем массиве сессий.
				// По этому признаку можно определить, выполняется
				// ли выход из курса и следует ли вызвать обновление
				// данных задания.
				// Старая версия это делала только при изменении
				// сессии курса. В этом случае следует избыточно вызывать
				// обновление данных курса.				
				ЭтаВерсияПередаетСессиюКурсаПриВыходе = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Сессия.id) Тогда
				
				СессияСсылка = Документы.СессияЭлектронногоРесурсаСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Сессия.id));
								
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.СессияЭлектронногоРесурсаСУЗ");
				ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СессияСсылка);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаДанных.Заблокировать();
				
				СессияОбъект = СессияСсылка.ПолучитьОбъект();
				
				НоваяСтрокаИстории = СессияОбъект.ИсторияИзменений.Добавить();
				НоваяСтрокаИстории.Дата = СессияОбъект.ДатаИзменения;
				НоваяСтрокаИстории.Данные = СессияОбъект.Данные;
				НоваяСтрокаИстории.ДанныеТекстовые = СессияОбъект.ДанныеТекстовые;			
				
			Иначе
				
				СессияОбъект = Документы.СессияЭлектронногоРесурсаСУЗ.СоздатьДокумент();
				
				СессияОбъект.Дата = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Сессия.dateModification);
				СессияОбъект.Пользователь = Пользователь; 
				СессияОбъект.ЭлектронныйРесурс = ЭлектронныйРесурс;
				СессияОбъект.КонтрольнаяСумма = КонтрольнаяСумма;
				СессияОбъект.ПрохождениеОбучения = ПрохождениеОбучения;
				СессияОбъект.Задание = Задание;
				СессияОбъект.ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ[Сессия.type];
				
				Если ТипЗнч(Сессия.parentSession) = Тип("Строка") Тогда
					
					СессияОбъект.РодительскаяСессия = 	Документы.СессияЭлектронногоРесурсаСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Сессия.parentSession)); // Определена
					
				ИначеЕсли ТипЗнч(Сессия.parentSession) = Тип("Структура") Тогда
					
					СессияОбъект.РодительскаяСессия = Неопределено;
					
					Для каждого СессияРодительская Из МассивСессий Цикл
						
						СессияНайдена = Истина;
						
						Для каждого ЗначениеДляПоиска Из Сессия.parentSession Цикл
							
							НайденноеЗначение = Неопределено;
							
							СессияРодительская.Свойство(ЗначениеДляПоиска.Ключ, НайденноеЗначение);
							
							Если НайденноеЗначение <> ЗначениеДляПоиска.Значение Тогда
								СессияНайдена = Ложь;	
							КонецЕсли;
							
						КонецЦикла;
						
						Если СессияНайдена Тогда
							
							СессияОбъект.РодительскаяСессия = Документы.СессияЭлектронногоРесурсаСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СессияРодительская.id));
							
							Сессия.parentSession = СессияРодительская.id;
							
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					СессияОбъект.РодительскаяСессия = Документы.СессияЭлектронногоРесурсаСУЗ.ПустаяСсылка(); // Не требуется
					
				КонецЕсли;
				
				СессияОбъект.Записать(); // Записываем без проведения для получения ссылки
				
			КонецЕсли;
			
			СессияСсылка = СессияОбъект.Ссылка;
			
			Сессия.id = Строка(СессияСсылка.УникальныйИдентификатор());
			
			СессияОбъект.Данные = Новый ХранилищеЗначения(Сессия);
			СессияОбъект.ДанныеТекстовые = Новый ХранилищеЗначения(ОбщегоНазначенияСУ.ДанныеВJSON(Сессия));
			СессияОбъект.ДатаИзменения = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Сессия.dateModification);
			
			СессияОбъект.Записать(РежимЗаписиДокумента.Проведение);		
			
			Если СессияОбъект.ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.course Тогда			
				СледуетОбновитьДанныеОбучения = Истина;			
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтоПроверкаПреподавателем Тогда
			СледуетОбновитьДанныеОбучения = Истина;
		КонецЕсли;
		
		// Обновляем данные обучения
		//
		
		Если СледуетОбновитьДанныеОбучения ИЛИ НЕ ЭтаВерсияПередаетСессиюКурсаПриВыходе Тогда
			ЭлектронныеРесурсыПереопределяемый.ПослеСохраненияДанныхПрохожденияПубликации(ЭлектронныйРесурс, ПрохождениеОбучения, Задание, Пользователь, СледуетОбновитьДанныеОбучения);
		КонецЕсли;		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем результат сохранения
	//	
	
	РезультатЗаписи = Новый Массив();
	
	Для каждого Сессия Из МассивСессий Цикл
		
		НовыйРезультат = Новый Структура();
		
		КлючСессии = Новый Структура();
		
		Для каждого ИмяСвойства Из Сессия.keyProperties Цикл
			КлючСессии.Вставить(ИмяСвойства, Сессия[ИмяСвойства]);	
		КонецЦикла;
		
		НовыйРезультат.Вставить("key", КлючСессии);
		
		Для каждого ИмяСвойства Из Сессия.serverProperties Цикл
			НовыйРезультат.Вставить(ИмяСвойства, Сессия[ИмяСвойства]);	
		КонецЦикла;
		
		РезультатЗаписи.Добавить(НовыйРезультат);
		
	КонецЦикла;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(РезультатЗаписи);
	
КонецФункции

Функция ВебСсылкаПубликации(ЭлектронныйРесурс, ЭлементСодержания, ПрохождениеОбучения, Задание, Пользователь) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Возврат ВебКабинетСУЗ.СсылкаНаЭлектронныйРесурс(ЭлектронныйРесурс, ЭлементСодержания, ПрохождениеОбучения, Задание, Пользователь);
	
	//----------------------------------//
	
	// Не используется
	
КонецФункции

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//
// Для задания обработчиков параметров сеанса следует использовать шаблон:
// Обработчики.Вставить("<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>", "Обработчик");
//
// Примечание. Символ '*'используется в конце имени параметра сеанса и обозначает,
//             что один обработчик будет вызван для инициализации всех параметров сеанса
//             с именем, начинающимся на слово НачалоИмениПараметраСеанса.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	// ЭлектронныеРесурсы
	Обработчики.Вставить("ПутьКРабочемуКаталогуСУ", "ОбъектыСУЗ.УстановкаПараметровСеанса");
	Обработчики.Вставить("АдресРабочегоКаталогаСУ", "ОбъектыСУЗ.УстановкаПараметровСеанса");
	// Конец ЭлектронныеРесурс
	
КонецПроцедуры

Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ПараметрыЭлектронныыеРесурсы = Новый Структура;
	
	ПараметрыЭлектронныыеРесурсы.Вставить("Версия", ВерсияПодсистемы());
	ПараметрыЭлектронныыеРесурсы.Вставить("ВерсияИБ", ОбновлениеИнформационнойБазы.ВерсияИБ(ЭлектронныеРесурсыПереопределяемый.ИмяПодсистемы()));
	ПараметрыЭлектронныыеРесурсы.Вставить("ИспользоватьОбщийКаталогВТонкомКлиенте", Константы.ИспользоватьОбщийКаталогВТонкомКлиентеСУЗ.Получить());
	ПараметрыЭлектронныыеРесурсы.Вставить("НомерБазовогоПакетаДанных", ПолучитьОбщийМакет("НомерБазовогоПакетаДанныхСУЗ").ПолучитьТекст());	
	
	Параметры.Вставить("ЭлектронныеРесурсы", ПараметрыЭлектронныыеРесурсы);
	Параметры.Вставить("ДатаПервогоЗапуска", Константы.ДатаПервогоЗапускаСУ.Получить());
	
	Если НЕ ЗначениеЗаполнено(Параметры.ДатаПервогоЗапуска) Тогда
		Константы.ДатаПервогоЗапускаСУ.Установить(ТекущаяДатаСеанса());	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПараметрыРаботыКлиента(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыРаботыКлиентаПриЗапуске(Параметры);
	
КонецПроцедуры

Функция ДанныеОПрохожденииЭлектронногоРесурса(ЭлектронныйРесурс, ФрагментЭлектронногоРесурса = Неопределено, Пользователь = Неопределено, ПрохождениеОбучения = Неопределено, Задание = Неопределено, МетодВыбораПопыткиПрохождения = Неопределено, ВидОбучения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем необходимые переменные
	
	Если МетодВыбораПопыткиПрохождения = Неопределено Тогда		
		МетодВыбораПопыткиПрохождения = Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.СНаибольшимРезультатом;		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ЭлектронныеРесурсыПереопределяемый.ПользовательОбучения(Пользователь, ПрохождениеОбучения);		
	КонецЕсли;
	
	Если ФрагментЭлектронногоРесурса = Неопределено Тогда
		ФрагментЭлектронногоРесурса = Справочники.СодержаниеСУЗ.ПустаяСсылка();
	КонецЕсли;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;	
	
	Если ВидОбучения = Неопределено Тогда
		ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрохождениеОбучения, "ПроведениеОбучения, Сценарий");
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ДанныеПрохождения.ПроведениеОбучения, ДанныеПрохождения.Сценарий);
	КонецЕсли;
		
	//----------------------------------//	
	
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	// ПрохождениеОбучения = "";
	// Задание = "";
	// ВидОбучения = "";
	//----------------------------------//	
	
	ЕстьНезавершенныеПопытки = Ложь;
	ЕстьНеРеализованныеДобавленныеПопытки = Ложь;
	ЗатраченоВремениВСекундах = 0;
	ПроверяетсяПреподавателем = Ложь;
	ПроверенПреподавателем = Истина;	
	ОбщийРезультат = 0;
	ТекущийРезультат = 0;
	ВыставляетсяОценка = Ложь;
	ПопыткаПрохожденияФрагмента = Неопределено;
	
	ПовторныеПрохождения = РегистрыСведений.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ.ПовторныеПрохождения(Пользователь, ПрохождениеОбучения, Задание); 
	
	// Получаем элементы содержания
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка КАК Ссылка,
		|	СодержаниеСУЗ.СсылкаНаЭлемент КАК СсылкаНаОбъектСУЗ,
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.ПодборкиСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.ПодборкиСУЗ).НазначениеТестирования
		|	КОНЕЦ КАК НазначениеТестирования,
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.ПодборкиСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.ПодборкиСУЗ).ЭтоТест
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТест,
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.РесурсыСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.РесурсыСУЗ).SCO
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоSCO
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И &ОтборПоСсылке";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Если ЗначениеЗаполнено(ФрагментЭлектронногоРесурса) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", "СодержаниеСУЗ.Ссылка = &ФрагментЭлектронногоРесурса");
		Запрос.УстановитьПараметр("ФрагментЭлектронногоРесурса", ФрагментЭлектронногоРесурса);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСсылке", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	ТаблицаСодержания = Результат.Выгрузить();	
	
	// Получаем данные о прохождении электронного ресурса
	
	Если ЗначениеЗаполнено(ФрагментЭлектронногоРесурса) Тогда
		
		Если ТаблицаСодержания.Количество() > 0 Тогда
			
			// Получаем все попытки прохождения фрагмента электронного ресурса
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Результат КАК Результат,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПроверенПреподавателем КАК ПроверенПреподавателем,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК ПопыткаПрохожденияФрагмента,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Регистратор КАК ПопыткаВыполнения,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткаЗавершена КАК ПопыткаЗавершена,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ КАК СсылкаНаОбъектСУЗ,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ДатаНачалаПрохождения КАК Дата,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания КАК ЭлементСодержания,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВремяПрохожденияВСекундах КАК ВремяПрохожденияВСекундах,
				|	ВЫБОР
				|		КОГДА ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ ССЫЛКА Справочник.ПодборкиСУЗ
				|			ТОГДА ВЫРАЗИТЬ(ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.СсылкаНаОбъектСУЗ КАК Справочник.ПодборкиСУЗ).ЭтоТест
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоТест,
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ВыставляетсяОценка КАК ВыставляетсяОценка
				|ИЗ
				|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсовСУЗ
				|ГДЕ
				|	ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Пользователь = &Пользователь
				|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ЭлементСодержания = &ЭлементСодержания
				|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
				|	И ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Задание = &Задание";
			
			
			Запрос.УстановитьПараметр("Пользователь", Пользователь);
			Запрос.УстановитьПараметр("ЭлементСодержания", ФрагментЭлектронногоРесурса);
			Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
			Запрос.УстановитьПараметр("Задание", Задание);
			
			Результат = Запрос.Выполнить();
			
			ТаблицаПопыток = Результат.Выгрузить();
			
			Если ТаблицаПопыток.Количество() > 0 Тогда
				ПопыткаДляСохранения = ПопыткаПрохожденияЭлементаСодержанияЭлектронногоРесурса(ТаблицаПопыток,,ФрагментЭлектронногоРесурса.СсылкаНаЭлемент, МетодВыбораПопыткиПрохождения, ПовторныеПрохождения);
				ЕстьНеРеализованныеДобавленныеПопытки = ЕстьНеРеализованныеДобавленныеПопытки(ТаблицаПопыток, Пользователь, ФрагментЭлектронногоРесурса, ПрохождениеОбучения, Задание);
			Иначе
				ПопыткаДляСохранения = Неопределено;
				ЕстьНеРеализованныеДобавленныеПопытки = Ложь;
			КонецЕсли;			
			
			Если ТаблицаПопыток.Найти(Ложь, "ПопыткаЗавершена") <> Неопределено Тогда
				ЕстьНезавершенныеПопытки = Истина;
			КонецЕсли;
			
			Если ПопыткаДляСохранения <> Неопределено Тогда
				
				ПроцентЗавершенных          = 100;
				ТекущийРезультат            = 0;
				ОбщийРезультат              = ПопыткаДляСохранения.Результат;
				ПопыткаПрохожденияФрагмента = ПопыткаДляСохранения.ПопыткаПрохожденияФрагмента;	
				
			КонецЕсли;	
			
			Для каждого СтрокаТП Из ТаблицаПопыток Цикл
				
				Если СтрокаТП.ПроверяетсяПреподавателем Тогда
					ПроверяетсяПреподавателем = Истина;
				КонецЕсли;
				
				Если СтрокаТП.ПроверяетсяПреподавателем И НЕ СтрокаТП.ПроверенПреподавателем Тогда
					ПроверенПреподавателем = Ложь;
				КонецЕсли;
				
				Если СтрокаТП.ВыставляетсяОценка Тогда
					ВыставляетсяОценка = Истина;
				КонецЕсли;
				
				ЗатраченоВремениВСекундах = ЗатраченоВремениВСекундах + СтрокаТП.ВремяПрохожденияВСекундах;
				
			КонецЦикла;			
			
			Если ПопыткаДляСохранения = Неопределено Тогда
				СтрокаТС = ТаблицаСодержания[0];
				ВыставляетсяОценкаЗаЭлемент = ВыставляетсяОценкаЗаЭлемент(
					СтрокаТС.ЭтоТест, СтрокаТС.НазначениеТестирования, СтрокаТС.ЭтоSCO, ПопыткаДляСохранения);				
				Если ВыставляетсяОценкаЗаЭлемент Тогда
					ВыставляетсяОценка = Истина;
				КонецЕсли;				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе		

		// Получаем попытки прохождения всех элементов содержания

		ТаблицаПопытокПрохождения = РегистрыСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.ПопыткиПрохождения(Пользователь, ПрохождениеОбучения, Задание, ЭлектронныйРесурс);  
		
		Если ТаблицаПопытокПрохождения.Найти(Ложь, "ПопыткаЗавершена") <> Неопределено Тогда
			ЕстьНезавершенныеПопытки = Истина;
		КонецЕсли;
		
		ЕстьНеРеализованныеДобавленныеПопытки = ЕстьНеРеализованныеДобавленныеПопытки(ТаблицаПопытокПрохождения, Пользователь,, ПрохождениеОбучения, Задание);
		
		// Получаем баллы
		
		ВсегоЭлементов        = 0;
		ЗавершеноЭлементов    = 0;
		СуммаБаллов           = 0;
		МаксимумБаллов        = 0;
		МаксимумТекущихБаллов = 0;
				
		Для каждого СтрокаТС Из ТаблицаСодержания Цикл
			
			// Считаем количество завершенных элементов и всего элементов
			
			ПопыткаПрохожденияЭС = ПопыткаПрохожденияЭлементаСодержанияЭлектронногоРесурса(ТаблицаПопытокПрохождения, СтрокаТС.Ссылка, СтрокаТС.СсылкаНаОбъектСУЗ, МетодВыбораПопыткиПрохождения, ПовторныеПрохождения);
			
			Если ЗначениеЗаполнено(ПопыткаПрохожденияЭС) Тогда
				ЗавершеноЭлементов = ЗавершеноЭлементов + 1;
			Иначе
				НезаконченнаяПопытка = ПопыткаПрохожденияЭлементаСодержанияЭлектронногоРесурса(ТаблицаПопытокПрохождения, СтрокаТС.Ссылка, СтрокаТС.СсылкаНаОбъектСУЗ, Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.Последнюю, ПовторныеПрохождения, Ложь);
				Если ЗначениеЗаполнено(НезаконченнаяПопытка)
					И НезаконченнаяПопытка.ЗавершеноВПроцентах > 0 Тогда
					ЗавершеноЭлементов = ЗавершеноЭлементов + (НезаконченнаяПопытка.ЗавершеноВПроцентах / 100);
				КонецЕсли;
			КонецЕсли;	
			
			ВсегоЭлементов = ВсегоЭлементов + 1;
			
			// Считаем баллы за элементы
			
			ВыставляетсяОценкаЗаЭлемент = ВыставляетсяОценкаЗаЭлемент(
				СтрокаТС.ЭтоТест, СтрокаТС.НазначениеТестирования, СтрокаТС.ЭтоSCO, ПопыткаПрохожденияЭС);
			
			Если ВыставляетсяОценкаЗаЭлемент Тогда
				
				Если ЗначениеЗаполнено(ПопыткаПрохожденияЭС) Тогда
					СуммаБаллов = СуммаБаллов + ПопыткаПрохожденияЭС.Результат;
					МаксимумТекущихБаллов = МаксимумТекущихБаллов + 100;
					Если ПопыткаПрохожденияЭС.ВыставляетсяОценка Тогда
						ВыставляетсяОценка = Истина;
					КонецЕсли;
				Иначе
					ВыставляетсяОценка = Истина;
				КонецЕсли;
				
				МаксимумБаллов = МаксимумБаллов + 100;
				
			КонецЕсли;
						
		КонецЦикла;

		Если ВсегоЭлементов > 0 Тогда
			ПроцентЗавершенных = Окр((ЗавершеноЭлементов / ВсегоЭлементов)*100);
		Иначе
			ПроцентЗавершенных = 100;
		КонецЕсли;
		
		Если МаксимумБаллов > 0 Тогда 
			ОбщийРезультат = Окр((СуммаБаллов / МаксимумБаллов)*100);
		Иначе
			Если ПроцентЗавершенных = 100 Тогда
				ОбщийРезультат = 100;
			Иначе
				ОбщийРезультат = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если МаксимумТекущихБаллов > 0 Тогда
			ТекущийРезультат = Окр((СуммаБаллов / МаксимумТекущихБаллов)*100);
		Иначе
			Если ПроцентЗавершенных = 100 Тогда
				ТекущийРезультат = 100;
			Иначе
				ТекущийРезультат = 0;
			КонецЕсли;
		КонецЕсли;
		
		// Определяем затраченное время и необходимость проверки
		// преподавателем. Важно это делать по всем попыткам, а не 
		// только тем, что учитываются выше в результате.
		
		ПопыткаПрохожденияФрагмента = Неопределено;		
		
		Для каждого СтрокаТП Из ТаблицаПопытокПрохождения Цикл
		
			Если СтрокаТП.ПроверяетсяПреподавателем Тогда
				ПроверяетсяПреподавателем = Истина;
			КонецЕсли;
			
			Если СтрокаТП.ПроверяетсяПреподавателем И НЕ СтрокаТП.ПроверенПреподавателем Тогда
				ПроверенПреподавателем = Ложь;
			КонецЕсли;
			
			ЗатраченоВремениВСекундах = ЗатраченоВремениВСекундах + СтрокаТП.ВремяПрохожденияВСекундах;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	Если НЕ ПроверяетсяПреподавателем Тогда
		ПроверенПреподавателем = Ложь;
	КонецЕсли;		
		
	//3. Формируем структуру данных и возвращаем результат
	
	ДанныеОПрохождении = Новый Структура;
	ДанныеОПрохождении.Вставить("ЗавершеноВПроцентах", ПроцентЗавершенных);
	ДанныеОПрохождении.Вставить("Баллы", ОбщийРезультат);
	ДанныеОПрохождении.Вставить("ТекущиеБаллы", ТекущийРезультат);
	ДанныеОПрохождении.Вставить("ПопыткаПрохожденияФрагмента", ПопыткаПрохожденияФрагмента);
	ДанныеОПрохождении.Вставить("ЕстьНезавершенныеПопытки", ЕстьНезавершенныеПопытки);
	ДанныеОПрохождении.Вставить("ЕстьНеРеализованныеДобавленныеПопытки", ЕстьНеРеализованныеДобавленныеПопытки);
	ДанныеОПрохождении.Вставить("ПроверяетсяПреподавателем", ПроверяетсяПреподавателем);
	ДанныеОПрохождении.Вставить("ПроверенПреподавателем", ПроверенПреподавателем);		
	ДанныеОПрохождении.Вставить("ЗатраченоВремениВСекундах", ЗатраченоВремениВСекундах);
	ДанныеОПрохождении.Вставить("ВыставляетсяОценка", ВыставляетсяОценка);
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	Если НЕ ВидОбучения.ВыставляетсяОценка Тогда
		ДанныеОПрохождении.Вставить("ВыставляетсяОценка", Ложь);
	КонецЕсли;
	
	Если Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения) Тогда	
		ДанныеОПрохождении.Вставить("ПроверяетсяПреподавателем", Ложь);
		ДанныеОПрохождении.Вставить("ПроверенПреподавателем", Ложь);		
	КонецЕсли;	
	//----------------------------------//
	
	Возврат ДанныеОПрохождении;	
	
КонецФункции

Функция ВыставляетсяОценкаЗаЭлемент(ЭтоТест, НазначениеТестирования, ЭтоSCO, ПопыткаПрохожденияЭС)
	
	Если ЭтоТест И НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоSCO И ПопыткаПрохожденияЭС = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоSCO И ПопыткаПрохожденияЭС <> Неопределено И ПопыткаПрохожденияЭС.ВыставляетсяОценка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Функция ПопыткаПрохожденияЭлементаСодержанияЭлектронногоРесурса(ТаблицаПопыток, ЭлементСодержания = Неопределено, СсылкаНаОбъектСУЗ, Знач МетодВыбораПопыткиПрохождения, ПовторныеПрохождения, ТолькоЗавершенные = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(МетодВыбораПопыткиПрохождения) Тогда
		МетодВыбораПопыткиПрохождения = Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.СНаибольшимРезультатом;
	КонецЕсли;	
	
	ПопыткаДляСохранения = Неопределено;
	
	Для каждого Строка Из ТаблицаПопыток Цикл

		Если ТолькоЗавершенные И НЕ Строка.ПопыткаЗавершена Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементСодержания <> Неопределено Тогда		
			Если Строка.ЭлементСодержания <> ЭлементСодержания Тогда
				Продолжить;
			КонецЕсли;			
		КонецЕсли;
		
		// Примечание: учет параметра СсылкаНаОбъектСУЗ необходим, так как
		// могут быть случаи, когда элемент содержания состоит из нескольких элементов,
		// а учитывать для анализа требуется только основной, который указан как фрагмент.
		
		Если Строка.СсылкаНаОбъектСУЗ <> СсылкаНаОбъектСУЗ Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаВТаблицеПовторныхПрохождений = ПовторныеПрохождения.Найти(Строка.ЭлементСодержания, "ЭлементСодержания");
		
		Если СтрокаВТаблицеПовторныхПрохождений <> Неопределено
			И СтрокаВТаблицеПовторныхПрохождений.Дата > Строка.Дата Тогда
			
			Продолжить; // Не учитываем попытки до даты, когда надо пройти элемент повторно
			
		КонецЕсли;
		
		Если МетодВыбораПопыткиПрохождения = Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.Последнюю Тогда
			
			Если ПопыткаДляСохранения = Неопределено ИЛИ ПопыткаДляСохранения.Дата < Строка.Дата Тогда
				ПопыткаДляСохранения = Строка;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МетодВыбораПопыткиПрохождения = Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.СНаибольшимРезультатом Тогда
			
			Если ПопыткаДляСохранения = Неопределено ИЛИ ПопыткаДляСохранения.Результат < Строка.Результат Тогда
				ПопыткаДляСохранения = Строка;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МетодВыбораПопыткиПрохождения = Перечисления.МетодВыбораПопыткиПрохожденияСУЗ.СНаименьшимРезультатом Тогда
			
			Если ПопыткаДляСохранения = Неопределено ИЛИ ПопыткаДляСохранения.Результат > Строка.Результат Тогда
				ПопыткаДляСохранения = Строка;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПопыткаДляСохранения;
	
КонецФункции

Функция ЕстьНеРеализованныеДобавленныеПопытки(ТаблицаПопыток, Пользователь, ЭлементСодержания, ПрохождениеОбучения, Задание)
	
	// Находим дату последней попытки
	
	ДатаПоследнейПопытки = Дата("00010101");
	
	Для каждого Строка Из ТаблицаПопыток Цикл

		Если Строка.Дата > ДатаПоследнейПопытки И Строка.ПопыткаЗавершена Тогда
			ДатаПоследнейПопытки = Строка.Дата;
		КонецЕсли;

	КонецЦикла;
	
	// Ищем добавленную попытку после даты последней попытки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПопыткиПрохожденияТестовСУЗ.Период
		|ИЗ
		|	РегистрСведений.ДополнительныеПопыткиПрохожденияТестовСУЗ КАК ДополнительныеПопыткиПрохожденияТестовСУЗ
		|ГДЕ
		|	ДополнительныеПопыткиПрохожденияТестовСУЗ.Период > &ДатаПоследнейПопытки
		|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.Пользователь = &Пользователь
		|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения";
		
	Если ЗначениеЗаполнено(Задание)	Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.Задание = &Задание";
		
		Запрос.УстановитьПараметр("Задание", Задание);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементСодержания)	Тогда 
		
		Запрос.Текст = Запрос.Текст + "
		|	И ДополнительныеПопыткиПрохожденияТестовСУЗ.ЭлементСодержания = &ЭлементСодержания";

		Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
		
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("ДатаПоследнейПопытки", ДатаПоследнейПопытки);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АдресПубликацииЭлектронногоРесурса(СтрокаПараметровЗапроса, БазовыйАдрес, АдресВыхода) Экспорт
	
	// Получаем переменные
	
	Результат = Новый Структура("Адрес, ОписаниеОшибки, КодОшибки, РазмещеныДанныеДляВебКабинета, КонтрольнаяСумма", "", "", "", Ложь, "");
	
	СтруктураПараметровСтраницы         = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(СтрокаПараметровЗапроса);
	ИдентификаторЭлектронногоРесурса    = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "res");
	ИдентификаторПрохожденияОбучения    = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "userActivity");
	ИдентификаторПроведенияОбучения     = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "providingEducation");
	ИдентификаторЗадания                = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "task");
	ЦелевоеОкно                         = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "window");
	ИдентификаторПользователя           = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "user");
	
	ИдентификаторЭлементаСодержания     = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "item");
	ИдентификаторЭлементаПодборки       = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "idGroup");
	ИдентификаторЭлементаГлоссария      = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "elementGlossary");
	ИдентификаторОбъектаСУЗ             = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "object");
	СловаДляВыделенияСУЗ                = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "highlight");
	ТолькоПросмотр                      = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураПараметровСтраницы, "readonly");
	
	// Делаем базовые проверки
	
	Если ЗначениеЗаполнено(ИдентификаторЭлектронногоРесурса) Тогда
		ЭлектронныйРесурс = Справочники.СводыЗнанийСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЭлектронногоРесурса));
	Иначе
		Результат.КодОшибки = "errorData";
		Результат.ОписаниеОшибки = НСтр("ru = 'Идентификатор электронного ресурса не задан'");
		Возврат Результат;
	КонецЕсли;
	
	СвойстваПубликации = ЭлектронныеРесурсыСУЗ.ПолучитьСвойстваПубликации(ЭлектронныйРесурс);
	
	Если СвойстваПубликации = Неопределено Тогда
		Результат.КодОшибки = "publicationNotFound";
		Результат.ОписаниеОшибки = НСтр("ru = 'Публикация не найдена'");
		Возврат Результат;
	КонецЕсли;
	
	Если РазработкаСУЗ.ИспользоватьВстроенныйПлеерКурсовВебКабинета() Тогда
		
		Если ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения)
			ИЛИ ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
			
			Если ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
				// Задание
				ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПрохожденияОбучения));
				ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеОбучения, "ПроведениеОбучения");
				ПлеерПроведенияОбучения = Документы.ПроведениеОбученияСУО.ПлеерВебКабинетаЗадания(ПроведениеОбучения, ЭлектронныйРесурс);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
				// Дополнительные материалы
				ПроведениеОбучения = Документы.ПроведениеОбученияСУО.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторПроведенияОбучения));
				ПлеерПроведенияОбучения = Документы.ПроведениеОбученияСУО.ПлеерВебКабинетаДополнительногоМатериала(ПроведениеОбучения, ЭлектронныйРесурс);			
			КонецЕсли;
			
			Если ПлеерПроведенияОбучения = Перечисления.ПлеерыКурсовВебКабинетаСУЗ.Встроенный Тогда
				Если НЕ СвойстваПубликации.РазмещеныДанныеДляВебКабинета Тогда
					Результат.КодОшибки = "publicationNotFound";
					Результат.ОписаниеОшибки = НСтр("ru = 'Публикация данных встроенного плеера не найдена'");
					Возврат Результат;	
				КонецЕсли;
				Результат.РазмещеныДанныеДляВебКабинета	= Истина;
			Иначе		
				Результат.РазмещеныДанныеДляВебКабинета	= Ложь;
			КонецЕсли;
			
		Иначе			
			// Библиотека
			Результат.РазмещеныДанныеДляВебКабинета = СвойстваПубликации.РазмещеныДанныеДляВебКабинета;
		КонецЕсли;
	Иначе
		
		Результат.РазмещеныДанныеДляВебКабинета = Ложь;
		
	КонецЕсли;
	
	Результат.КонтрольнаяСумма = СвойстваПубликации.КонтрольнаяСумма;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Делаем проверки прохождения обучения
	
	Если ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения)
		И ЗначениеЗаполнено(ИдентификаторЗадания)
		И ТолькоПросмотр <> "true"
		И НЕ ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		
		ПрохождениеОбучения = Документы.ПрохождениеОбученияСУО.ПолучитьСсылку(
			Новый УникальныйИдентификатор(ИдентификаторПрохожденияОбучения));
						
		РезультатПрохожденияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, ЭлектронныйРесурс,,,,,,Истина);
		
		Если РезультатПрохожденияЗадания.ОписаниеПрохожденияМероприятия.ВремяИстекло Тогда
			
			ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПопыткаВыполненияЗаданияСУО, РезультатПрохожденияЗадания.ПопыткаВыполненияЗадания);
			ВебКабинетСУО.ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, РезультатПрохожденияЗадания.ОписаниеПрохожденияМероприятия);
			
			Результат.КодОшибки = "expiredTime";
			Результат.ОписаниеОшибки = НСтр("ru = 'Закончилось отведенное время'");
			Возврат Результат;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	//----------------------------------//
	
	// Получаем адрес электронного ресурса
	
	АдресЭлектронногоРесурса = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуПубликацииЭлектронногоРесурса(ЭлектронныйРесурс, СвойстваПубликации.КонтрольнаяСумма, БазовыйАдрес, "");
	АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "index.html?";
	
	АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "api=ws";
	
	Если ЗначениеЗаполнено(ИдентификаторПрохожденияОбучения) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&userActivity=" + Строка(ИдентификаторПрохожденияОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторПроведенияОбучения) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&providingEducation=" + Строка(ИдентификаторПроведенияОбучения);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&task=" + Строка(ИдентификаторЗадания);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЦелевоеОкно) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&window=" + ЦелевоеОкно;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&user=" + ИдентификаторПользователя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЭлементаСодержания) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&item=" + ИдентификаторЭлементаСодержания;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЭлементаПодборки) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&idGroup=" + ИдентификаторЭлементаПодборки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЭлементаГлоссария) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&elementGlossary=" + ИдентификаторЭлементаГлоссария;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторОбъектаСУЗ) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&object=" + ИдентификаторОбъектаСУЗ;
	КонецЕсли;
	
	Если ТипЗнч(СловаДляВыделенияСУЗ) = Тип("Строка")
		И ЗначениеЗаполнено(СловаДляВыделенияСУЗ) Тогда
		
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&highlight=" + СловаДляВыделенияСУЗ;
		
	КонецЕсли;
	
	Если ТипЗнч(СловаДляВыделенияСУЗ) = Тип("Массив")
		И СловаДляВыделенияСУЗ.Количество() > 0 Тогда
		
		Для каждого СловоДляВыделения Из СловаДляВыделенияСУЗ Цикл
			АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&highlight=" + СловоДляВыделения;	
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВыхода) Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&closeURL=" + АдресВыхода;
	КонецЕсли;
	
	Если ТолькоПросмотр = "true" Тогда
		АдресЭлектронногоРесурса = АдресЭлектронногоРесурса + "&readonly=true";
	КонецЕсли;
	
	Результат.Адрес = АдресЭлектронногоРесурса;
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьКаталогЭлектронногоРесурса(Знач ЭлектронныйРесурс, Знач КонтрольнаяСумма, Знач ПутьККаталогуВыгрузки,  Знач ПутьККаталогуПубликации, Знач ОчиститьКаталогПубликаций = Ложь) Экспорт
	
	РезультатИнициализации = Новый Структура("КаталогИнициализирован, ТекстОшибки, ПутьККаталогуПубликации", Ложь, "", "");
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(ПутьККаталогуВыгрузки)
		ИЛИ НЕ ЗначениеЗаполнено(ЭлектронныйРесурс)
		ИЛИ НЕ ЗначениеЗаполнено(КонтрольнаяСумма) Тогда
		
		РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Ошибка: не заданы обязательные параметры инициализации каталога'");
		
		Возврат РезультатИнициализации; 
		
	КонецЕсли;
	
	ПутьККаталогуПубликацииЭлектронногоРесурса = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуПубликацииЭлектронногоРесурса(ЭлектронныйРесурс, КонтрольнаяСумма, ПутьККаталогуВыгрузки);
	
	РезультатИнициализации.ПутьККаталогуПубликации = ПутьККаталогуПубликацииЭлектронногоРесурса;
	
	Если НЕ ОчиститьКаталогПубликаций Тогда
		
		КаталогПубликацииЭлектронногоРесурса = Новый Файл(ПутьККаталогуПубликацииЭлектронногоРесурса);
		
		Если КаталогПубликацииЭлектронногоРесурса.Существует() И КаталогПубликацииЭлектронногоРесурса.ЭтоКаталог() Тогда
			РезультатИнициализации.КаталогИнициализирован = Истина;
			Возврат РезультатИнициализации; // Каталог публикации уже инициализирован			
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем недостающие и удаляем старые каталоги
	//
	
	ПутьККаталогуЭлектронныхРесурсов           = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуЭлектронныхРесурсов(ПутьККаталогуВыгрузки);
	ПутьККаталогуПубликацийЭлектронногоРесурса = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуПубликацийЭлектронногоРесурса(ЭлектронныйРесурс, ПутьККаталогуВыгрузки);
	
	РезультатПроверки = ОбщегоНазначенияСУКлиентСервер.ПроверитьДоступностьКаталогаДляЗаписи(ПутьККаталогуВыгрузки);
	
	Если НЕ РезультатПроверки.ДоступенДляЗаписи Тогда
		РезультатИнициализации.ТекстОшибки = НСтр("ru = 'Ошибка инициализации каталога публикации электронного ресурса %1. Возможная причина: %2'");	
		РезультатИнициализации.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			РезультатИнициализации.ТекстОшибки, ПутьККаталогуВыгрузки, РезультатПроверки.ОписаниеОшибки);
		Возврат РезультатИнициализации;
	КонецЕсли;
	
	КаталогЭлектронныхРесурсов = Новый Файл(ПутьККаталогуЭлектронныхРесурсов);
	
	Если НЕ КаталогЭлектронныхРесурсов.Существует() ИЛИ НЕ КаталогЭлектронныхРесурсов.ЭтоКаталог() Тогда
		СоздатьКаталог(ПутьККаталогуЭлектронныхРесурсов);
	КонецЕсли;
	
	КаталогПубликацийЭлектронногоРесурса = Новый Файл(ПутьККаталогуПубликацийЭлектронногоРесурса);
	
	Если НЕ КаталогПубликацийЭлектронногоРесурса.Существует() ИЛИ НЕ КаталогПубликацийЭлектронногоРесурса.ЭтоКаталог() Тогда
		
		СоздатьКаталог(ПутьККаталогуПубликацийЭлектронногоРесурса);
		
	Иначе
	
		Если ОчиститьКаталогПубликаций Тогда
			Попытка
				УдалитьФайлы(ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ПутьККаталогуПубликацийЭлектронногоРесурса));
			Исключение
				ТекстСообщения = НСтр("ru = 'Во время удаления каталога %1 произошла ошибка'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПутьККаталогуПубликацийЭлектронногоРесурса);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	СоздатьКаталог(ПутьККаталогуПубликацииЭлектронногоРесурса);
	
	// Размещаем файл res.js
	//
	
	Обработки.ПубликацияЭлектронныхРесурсовСУЗ.РазместитьФайлResJS(ПутьККаталогуЭлектронныхРесурсов);
	
	// Выгружаем файлы публикации
	//
	
	Если ЗначениеЗаполнено(ПутьККаталогуПубликации) Тогда		
		ОбщегоНазначенияСУКлиентСервер.СкопироватьКаталог(ПутьККаталогуПубликации, ПутьККаталогуПубликацииЭлектронногоРесурса);		
	Иначе				
		ВызватьИсключение НСтр("ru = 'Путь к каталогу публикации не задан'");		
	КонецЕсли;
		
	// Завершаем
	//
	
	РезультатИнициализации.КаталогИнициализирован = Истина;
	Возврат РезультатИнициализации;
	

	
КонецФункции

Процедура ОтменитьПрохождениеЗадания(Знач ПрохождениеОбучения, Знач Задание) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветНаВопросСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
		|ГДЕ
		|	ОтветНаВопросСУЗ.СессияВыполненияТеста.Задание = &Задание
		|	И ОтветНаВопросСУЗ.СессияВыполненияТеста.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ОтветНаВопросСУЗ.Проведен = &Проведен
		|	И ОтветНаВопросСУЗ.Отменено = &Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияАктивногоРесурсаSCORM КАК ПопыткаВыполненияАктивногоРесурсаSCORM
		|ГДЕ
		|	ПопыткаВыполненияАктивногоРесурсаSCORM.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Задание = &Задание
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Проведен = &Проведен
		|	И ПопыткаВыполненияАктивногоРесурсаSCORM.Отменено = &Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияПодборкиВопросовСУЗ КАК ПопыткаВыполненияПодборкиВопросовСУЗ
		|ГДЕ
		|	ПопыткаВыполненияПодборкиВопросовСУЗ.Проведен = &Проведен
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.Задание = &Задание
		|	И ПопыткаВыполненияПодборкиВопросовСУЗ.Отменено = &Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияСтатичногоОбъектаСУЗ КАК ПопыткаВыполненияСтатичногоОбъектаСУЗ
		|ГДЕ
		|	ПопыткаВыполненияСтатичногоОбъектаСУЗ.Проведен = &Проведен
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.Задание = &Задание
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияСтатичногоОбъектаСУЗ.Отменено = &Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.Проведен = &Проведен
		|	И СессияЭлектронногоРесурсаСУЗ.Задание = &Задание
		|	И СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И СессияЭлектронногоРесурсаСУЗ.Отменено = &Отменено";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Проведен", Истина);
	Запрос.УстановитьПараметр("Отменено", Ложь);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Отменено = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////
// РАБОТА С ВНЕШНИМИ ПРОГРАММНЫМИ ПРОДУКТАМИ

Функция ОбработатьОтветНаВопрос(ДанныеJSON) Экспорт
	
	// Получаем основные переменные
	
	РезультатОбработки = Новый Структура("Код, Текст, Форма", 0, "", Неопределено);
	
	ПереводСвойств = Новый ТаблицаЗначений;
	
	ПереводСвойств.Колонки.Добавить("EN");
	ПереводСвойств.Колонки.Добавить("RU");
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "code";
	НоваяСтрока.RU = "Код";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "active";
	НоваяСтрока.RU = "Активный";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "complete";
	НоваяСтрока.RU = "Завершен";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "codeComment";
	НоваяСтрока.RU = "КодКомментария";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "startData";
	НоваяСтрока.RU = "НачальныеДанные";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "endData";
	НоваяСтрока.RU = "ИтоговыеДанные";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "answer";
	НоваяСтрока.RU = "ОтветПользователя";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "link";
	НоваяСтрока.RU = "Ссылка";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "score";
	НоваяСтрока.RU = "Результат";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "value";
	НоваяСтрока.RU = "Значение";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "startDate";
	НоваяСтрока.RU = "ДатаНачала";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "endDate";
	НоваяСтрока.RU = "ДатаОкончания";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "safely";
	НоваяСтрока.RU = "Безопасно";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "verAPI";
	НоваяСтрока.RU = "ВерсияAPI";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "data";
	НоваяСтрока.RU = "Данные";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "name";
	НоваяСтрока.RU = "Имя";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "typeValue";
	НоваяСтрока.RU = "ТипЗначения";
	
	НоваяСтрока = ПереводСвойств.Добавить();
	НоваяСтрока.EN = "toProgram";
	НоваяСтрока.RU = "ЗаполняетсяПрограммой";
	
	Данные = ОбщегоНазначенияСУ.JSONВДанные(ДанныеJSON, СтрДлина(ДанныеJSON)); 	
	
	ТаблицаЭтапов = Новый ТаблицаЗначений;
	
	Для каждого Реквизит Из Метаданные.Документы.ОтветНаВопросСУЗ.ТабличныеЧасти.ЭтапыРаботыВПрограмме.Реквизиты Цикл
		ТаблицаЭтапов.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
	КонецЦикла;
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	
	Для каждого Реквизит Из Метаданные.Справочники.ВопросыСУЗ.ТабличныеЧасти.Параметры.Реквизиты Цикл
		ТаблицаПараметров.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);	
	КонецЦикла;	
	
	ТаблицаПараметров.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("Строка"));
	
	Обработка = Новый Структура;
	
	// Заполняем переменные

	Для каждого Этап Из Данные.stages Цикл

		НоваяСтрока = ТаблицаЭтапов.Добавить();
		
		Для каждого Колонка Из ТаблицаЭтапов.Колонки Цикл
			НоваяСтрока[Колонка.Имя] = Этап[ПереводСвойств.Найти(Колонка.Имя, "RU").EN];	
		КонецЦикла;

	КонецЦикла;
	
	Для каждого Параметр Из Данные.parameters Цикл

		НоваяСтрока = ТаблицаПараметров.Добавить();
		
		Для каждого Колонка Из ТаблицаПараметров.Колонки Цикл
			НоваяСтрока[Колонка.Имя] = Параметр[ПереводСвойств.Найти(Колонка.Имя, "RU").EN];	
		КонецЦикла;

	КонецЦикла;	
	
	Для каждого Строка Из ТаблицаПараметров Цикл
	
		Если Строка.ТипЗначения = "Число" Тогда
			Строка.Значение = Число(Строка.Значение);
		КонецЕсли;
			
		Если Строка.ТипЗначения = "Дата" Тогда
			Строка.Значение = ОбщегоНазначенияСУКлиентСервер.ЧислоВДату(Строка.Значение);
		КонецЕсли;

		Если Строка.ТипЗначения = "Булево" Тогда
			Строка.Значение = ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(Строка.Значение);
		КонецЕсли;
			
	КонецЦикла;
	
	Обработка = Справочники.ПрограммныеПродуктыСУЗ.ОписаниеОбработки();
	
	Для каждого ПараметрОбработки Из Обработка Цикл
		Обработка.Вставить(ПараметрОбработки.Ключ, Данные.program.processor[ПереводСвойств.Найти(ПараметрОбработки.Ключ, "RU").EN]);	
	КонецЦикла;
	
	ДанныеДляОбработкиXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("Этапы, Параметры, Обработка", ТаблицаЭтапов, ТаблицаПараметров, Обработка));
	
	// Соединяемся с внешней базой
	
	ПрограммныйПродукт = Справочники.ПрограммныеПродуктыСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.program.id));
	
	РезультатОбработки = Справочники.ПрограммныеПродуктыСУЗ.ОбработатьОтветПользователя(ДанныеДляОбработкиXML, ПрограммныйПродукт, ОбъектыСУЗ.ТекущийПользователь());
	
	Если РезультатОбработки.Код <> 0 Тогда
		Возврат РезультатОбработки;
	КонецЕсли;
	
	// Сохраняем результат в переданные данные
	
	ДанныеДляОбработки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеДляОбработкиXML);
	
	Для каждого Этап Из Данные.stages Цикл
		
		НовыеСвойстваЭтапа = ДанныеДляОбработки.Этапы.Найти(Этап[ПереводСвойств.Найти("Код", "RU").EN], "Код");	
		
		Если НовыеСвойстваЭтапа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СвойстваЭтапа Из Этап Цикл
			
			НовоеЗначение = НовыеСвойстваЭтапа[ПереводСвойств.Найти(СвойстваЭтапа.Ключ, "EN").RU];
							
			Этап.Вставить(СвойстваЭтапа.Ключ, НовоеЗначение);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого Параметр Из Данные.parameters Цикл
		
		НовыеСвойстваПараметра = ДанныеДляОбработки.Параметры.Найти(Параметр[ПереводСвойств.Найти("Код", "RU").EN], "Код");	
		
		Если НовыеСвойстваПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СвойстваПараметра Из Параметр Цикл
			
			НовоеЗначение = НовыеСвойстваПараметра[ПереводСвойств.Найти(СвойстваПараметра.Ключ, "EN").RU];
							
			Параметр.Вставить(СвойстваПараметра.Ключ, НовоеЗначение);	

		КонецЦикла;
		
	КонецЦикла;
	
	// Завершаем
	
	Данные.Удалить("program"); // Не требуется
	
	ДанныеJSON = ОбщегоНазначенияСУ.ДанныеВJSON(Данные);
	
	Возврат РезультатОбработки;
	
КонецФункции

/////////////////////////////////////////////////////////////////
// ОТЧЕТЫ

Процедура ПриКомпоновкеРезультатаОтчета(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, КомпоновщикНастроек, СхемаКомпоновкиДанных) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	// Получаем данные отчета
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешниеНаборыДанных = ВнешниеНаборыДанныхОтчета(КомпоновщикНастроек, МакетКомпоновки);	
	
	// Выводим отчет
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	

КонецПроцедуры

Функция ВнешниеНаборыДанныхОтчета(КомпоновщикНастроек, МакетКомпоновки)	
	
	// Ищем установленный пользователем период
	
	УстановленныйПериод = Неопределено;
	
	Для каждого Элемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		ПараметрКомпоновкиДанныхПериод = Новый ПараметрКомпоновкиДанных("Период");
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И Элемент.Параметр = ПараметрКомпоновкиДанныхПериод
			И Элемент.Использование Тогда
			
			УстановленныйПериод = Элемент.Значение;
			Прервать;
			
		КонецЕсли;
		
	
	КонецЦикла;
	
	// Получаем даты начала и окончания периода
	
	Если УстановленныйПериод = Неопределено Тогда
		НачалоПериода = Дата(2000, 1, 1);
		КонецПериода = Дата(3999, 1, 1);
	Иначе		
		НачалоПериода = НачалоГода(УстановленныйПериод.ДатаНачала);
		КонецПериода  = КонецГода(?(ЗначениеЗаполнено(УстановленныйПериод.ДатаОкончания), УстановленныйПериод.ДатаОкончания, Дата(3999, 1, 1)));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ПопыткиПрохожденияЭлектронныхРесурсов.Период) КАК НачалоПериода,
	|	МАКСИМУМ(ПопыткиПрохожденияЭлектронныхРесурсов.Период) КАК КонецПериода
	|ИЗ
	|	РегистрСведений.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ КАК ПопыткиПрохожденияЭлектронныхРесурсов";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		НачалоПериода = Макс(НачалоПериода, Выборка.НачалоПериода);
		КонецПериода  = Мин(КонецПериода, Выборка.КонецПериода);
	КонецЕсли;
	
	// Получаем таблицу дат
	
	ТаблицаПериоды = Новый ТаблицаЗначений;
	ТаблицаПериоды.Колонки.Добавить("Год");
	ТаблицаПериоды.Колонки.Добавить("Месяц");
	
	ТекущаяДата = НачалоПериода;
	
	Пока ТекущаяДата < КонецПериода Цикл
		НоваяСтрока = ТаблицаПериоды.Добавить();
		НоваяСтрока.Год   = Год(ТекущаяДата);
		НоваяСтрока.Месяц = Месяц(ТекущаяДата);
		
		ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);
	КонецЦикла;
	
	// Завершаем
	
	ВнешниеНаборыДанных = Новый Структура("Периоды", ТаблицаПериоды);
	
	Возврат ВнешниеНаборыДанных;
		                                
КонецФункции

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//


// Учет истории разработки

Процедура УчетИсторииРазработкиЭлектронныхРесурсовПередЗаписьюСУОПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.ЭтоНовый());
КонецПроцедуры

Процедура УчетИсторииРазработкиЭлектронныхРесурсовСУОПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиИсториюРазработкиЭлектронныхРесурсовСУО") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый")
		И Источник.ДополнительныеСвойства.ЭтоНовый Тогда
		
		Действие = Перечисления.ДействияНадЭлектроннымиРесурсамиСУО.Добавление;
		
	Иначе
		
		Действие = ?(Источник.ПометкаУдаления, Перечисления.ДействияНадЭлектроннымиРесурсамиСУО.Удаление, Перечисления.ДействияНадЭлектроннымиРесурсамиСУО.Изменение);
				
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	Период       = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ИсторияРазработкиЭлектронныхРесурсовСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(Источник.Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.Период            = Период;
	НоваяЗапись.СсылкаНаОбъектСУЗ = Источник.Ссылка;
	НоваяЗапись.Пользователь      = Пользователь;
	НоваяЗапись.Действие          = Действие;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

	
//----------------------------------//
